validation/polydisperseBubbleFoam/Diaz/Diaz_11_9/constant/populationBalanceProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      populationaBalanceProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


coalescence off;

coalescenceKernel
{
    coalescenceFrequencyKernel CoulaloglouAndTavlarides;
    coalescenceEfficiencyKernel CoulaloglouAndTavlarides;

    Ca      Ca      [ 0 0 0 0 0 0 0 ]  0.88;
    Ceff    Ceff    [ 0 0 0 0 0 0 0 ]  6.0e9;
    ReExp   ReExp   [ 0 0 0 0 0 0 0 ]  -0.732;
    WeExp   WeExp   [ 0 0 0 0 0 0 0 ]  0.317;
}

breakup off;

breakupKernel
{
    breakupKernel Alopaeus;
    Cb        Cb        [ 0 0 -1 0 0 0 0 ] 6.0;
}

daughterDistribution
{
    daughterDistribution uniform;
}

// ************************************************************************* //
