validation/polydisperseBubbleFoam/Diaz/Diaz_11_9/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     polydisperseBubbleFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         250;

deltaT          1e-3;

writeControl    adjustableRunTime;

writeInterval   1;

purgeWrite      100;

writeFormat     ascii;

writePrecision  6;

writeCompression uncompressed;

timeFormat      general;

timePrecision   6;

runTimeModifiable yes;

adjustTimeStep  yes;

maxCo           0.1;

maxDeltaT       1;

functions
{
    fieldAverage1
    {
        type            fieldAverage;
        functionObjectLibs ( "libfieldFunctionObjects.so" );
        writeControl    writeTime;
        timeStart       50;
        fields
        (
            U.air
            {
                 mean        on;
                 prime2Mean  off;
                 base        time;
            }

            U.water
            {
                 mean        on;
                 prime2Mean  off;
                 base        time;
            }

            alpha.air
            {
                 mean        on;
                 prime2Mean  off;
                 base        time;
            }

            p_rgh
            {
                 mean        on;
                 prime2Mean  off;
                 base        time;
            }
            d.air
            {
                 mean        on;
                 prime2Mean  off;
                 base        time;
            }
        );
    }
    pProbes
    {
        type        probes;
        functionObjectLibs ("libsampling.so");
        probeLocations
        (
            (0  0.038   0.002)
            (0  0.213   0.002)
            (0  0.413   0.002)
        );

        fields
        (
            p_rgh
        );
    }
}


// ************************************************************************* //
